Tekla Open API Reference for Tekla Structures 2025
AngleList.Parse Method (String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle list in the current unit type
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static List<Angle> Parse(
	string text,
	IFormatProvider formatProvider,
	Angle.UnitType unitType
)
Public Shared Function Parse (
	text As String,
	formatProvider As IFormatProvider,
	unitType As Angle.UnitType
) As List(Of Angle)
Parameters
text
Type: System.String
Text to parse
formatProvider
Type: System.IFormatProvider
Format provider
unitType
Type: Tekla.Structures.Datatype.Angle.UnitType
Input unit type
Return Value
Type: List<Angle>
Resulting angle list from the text
See Also
Reference
AngleList Class
Parse Overload
Tekla.Structures.Datatype Namespace